02_OpenFOAM_FVM/cases/Ejercicio6/cylinder_medium/Allrun
#!/bin/sh

# Run from this directory
cd "${0%/*}" || exit 1

# Source tutorial run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

runApplication blockMesh
runApplication mirrorMesh

runApplication foamRun

#------------------------------------------------------------------------------
