02_OpenFOAM_FVM/cases/Ejercicio6/cylinder_medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          31;
        startFace       2337;
    }
    outlet
    {
        type            patch;
        nFaces          22;
        startFace       2368;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          27;
        startFace       2390;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2494;
        startFace       2417;
    }
)

// ************************************************************************* //
